Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ལྷའི་རྒྱལ་པོ་རབ་ཏུ་འཕྲུལ་གྱི་བར། །རབ་ཏུ་དགའ་ནས་འཛམ་བུའི་ཆུ་གསེར་གྱི། །
en: “The divine kings of the Heaven of Delightful Magical Forms made a net

source: དྲིལ་བུའི་དྲ་བ་གསེར་གྱི་དྲར་བཅས་དང་། །
en: To the knots of which they tied bells made of gold from the Jambu River

source: སྒྲ་སྙན་བཅས་པས་སྟོང་གསུམ་ཐམས་ཅད་བཀབ། །
en: That filled the whole Sahā realm with brilliant light and pleasant sound

source: ཐམས་ཅད་དོན་ལ་མི་འཇིགས་མཆོད་པའི་ཕྱིར། །
en: When, delighted, they draped it over this billion-world cosmos.

source: དབང་སྒྱུར་དག་གིས་ལྷ་ཡི་རིན་པོ་ཆེ། །རྣམ་པར་དག་ཅིང་གཟི་བརྗིད་མཐའ་ཡས་པ། །
en: “There were divine jewels, and truly they were clear, Radiating boundless light, immaculate and resplendent, Out of which the power-possessing gods magically created a net

source: འོད་གསལ་དྲི་མེད་དྲ་བ་གཅིག་ཀྱང་སྤྲུལ། །
en: With devotion to the One with the Confidence to Accomplish All Aims.

source: ཀླུ་དང་དྲི་ཟ་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། །
en: “The nāgas, gandharvas, and mahoragas,

source: ལྷ་མིན་མཁའ་ལྡིང་མིའམ་ཅི་ཀུན་གྱིས། །
en: And all the daityas and garuḍas along with the kinnaras

source: རང་རང་གནས་དང་བཀོད་པ་རྣམས་ཀྱིས་ནི། །འདོད་ཁམས་ལེགས་པར་བརྒྱན་ནས་མཛེས་པར་བྱས། །
en: Made the desire realm beautiful and adorned it With splendid arrangements like the surfaces of their own abodes.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་སྟོང་གསུམ་གྱི་དབང་པོ་ཚངས་པ་ཆེན་པོ་དབང་སྒྱུར་ཞེས་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མངོན་དུ་ཕྱོགས་པར་མཐོང་ནས་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ལ་སྨྲས་པ།
en: “Now, Śāntamati, it so happened that when Great Brahmā, the powerful one who was lord over this cosmos of a billion worlds, saw the Bodhisattva approaching the seat of awakening, he spoke to all the gods in the Heaven of Brahmā’s Assembly:

source: གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: “ ‘Friends, know this!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་མནབས་པ།
en: This is the Bodhisattva, the Mahāsattva! He has arrayed himself with great armor for the battle.

source: དམ་བཅས་པ་ཆེན་པོ་མ་བོར་བ།
en: He has not cast aside his great vow.

source: གོ་ཆ་སྲ་བ་མནབས་པ།
en: He has arrayed himself with rock-solid armor.

source: ཐུགས་ཡོངས་སུ་མི་སྐྱོ་བ།
en: His mind is not wearied.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལས་ངེས་པར་བྱུང་བ།
en: He is an adept at all the conduct of a bodhisattva.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་བྱོན་པ།
en: He has perfected all the perfections.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་མངའ་དབང་བརྙེས་པ།
en: He has achieved mastery of every stage of the bodhisattva’s path.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཐམས་ཅད་ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: He has completely purified every one of a bodhisattva’s motivations.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་རྗེས་སུ་ཞུགས་པ།
en: He understands the faculties of all beings.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་ལ་ཤིན་ཏུ་ཞུགས་པ།
en: He has fully comprehended all the secrets of the realized ones.

source: བདུད་ཀྱི་ལས་ཀྱི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: He has transcended all of Māra’s actions.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ།
en: None of the roots of his virtues depend on someone else.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: His authority has been empowered by all the realized ones.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རབ་ཏུ་ཐར་པའི་ལམ་སྟོན་པ་དེད་དཔོན་ཆེན་པོར་གྱུར་པ།
en: He is the great caravan leader who shows all beings the path to liberation.

source: བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་འཇོམས་པར་མཛད་པ། སྟོང་གསུམ་ན་དཔའ་བོ་གཅིག་པུར་གྱུར་པ།
en: He is the one true hero of this cosmos of a billion worlds who will rub out Māra’s whole assembly.

source: ཆོས་ཀྱི་སྨན་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པ། སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ།
en: He is the great king of doctors who has acquired all the medicine of the Dharma.

source: རྣམ་པར་གྲོལ་བའི་ཐབས་བརྙེས་པ། ཆོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ།
en: He is the great Dharma king who wears the royal turban of liberation.

source: ཤེས་རབ་ཀྱི་འོད་ཆེན་པོ་གཏོང་བ་ཏོག་ཆེན་པོའི་རྒྱལ་པོ།
en: He is the king whose mighty banner gives off the light of great wisdom.

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མ་གོས་པ་པདྨ་ཆེན་པོ་ལྟ་བུ།
en: Unstained by the eight worldly concerns, he is the true great lotus.

source: ཆོས་ཐམས་ཅད་ཀྱི་གཟུངས་མ་བསྙེལ་བ་རྒྱ་མཚོ་ཆེན་པོ་དང་འདྲ་བ།
en: Being one from whom the powerful memory of all the teachings and the formulas that support it have not been stolen, he is the true great ocean.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ། མི་གཡོ་བ། མི་བསྐྱོད་པ། རི་རབ་ཆེན་པོ་ལྟ་བུ།
en: Being unmovable, unshakeable, and devoid of aversion and attachment, he is the true mighty Mount Meru.

source: ཤིན་ཏུ་དྲི་མ་མེད་པ། ཤིན་ཏུ་ཡོངས་སུ་དག་པ། ཤིན་ཏུ་དཀར་བའི་བློ་དང་ལྡན་པ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་འདྲ་བ།
en: Completely unblemished, utterly pure, and possessing an intellect that is dazzlingly clear, he is the true priceless gem.

source: ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ། སེམས་ལས་སུ་རུང་བ།
en: Possessing power over all things, he has a mind that is ready for any endeavor.

source: ཚངས་པ་ཆེན་པོ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བདུད་ཀྱི་སྡེ་རབ་ཏུ་གདུལ་བ་དང་།
en: “ ‘The Bodhisattva, who is the true Great Brahmā, is approaching the seat of awakening.

source: བླ་ན་མེད་པ་ཡང་དག་པར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བཞེད་པ་དང་།
en: He wishes to awaken to unsurpassable and perfect awakening for the sake of conquering the soldiers of Māra.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་དང་།
en: He wishes to do so for the sake of perfecting the ten powers, the forms of self-assurance, and the eighteen unique attributes of a buddha.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་བསྐོར་བ་དང་། སེང་གེའི་སྒྲ་ཆེན་པོ་བསྒྲག་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་མཛད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མིག་རྣམ་པར་སྦྱང་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པ་དང་། སྔོན་དམ་བཅས་པ་ཡོངས་སུ་རྫོགས་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྟན་པར་བཞེད་པ་དང་།
en: He wishes to do so for the sake of turning the great wheel of the Dharma, for the sake of roaring the great lion’s roar, for the sake of satisfying all beings with the gift of the Dharma, for the sake of purifying the Dharma eyes of all beings, for the sake of using the Dharma to defeat all the proponents of other doctrines, for the sake of demonstrating the fulfillment of all his past promises to the blessed buddhas, and for the sake of gaining lordship over all things.

source: ཆོས་ཐམས་ཅད་ལ་དབང་ཕྱུག་གི་མངའ་དབང་བརྙེས་པར་མཛད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་ཀྱིས། དེ་ལ་གྲོགས་པོ་དག་ཁྱེད་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་ལ་སྤྲོ་བར་གྱིས་ཤིག །
en: Therefore, friends, you should all be restless with the longing to worship and serve the Bodhisattva!’

source: དེ་ནས་སྟོང་གསུམ་གྱི་བདག་པོ་ཚངས་པ་ཆེན་པོ་མི་མཇེད་ཀྱི་བདག་པོ་དེ་ཡིད་རབ་ཏུ་དགའ་ནས་ཚངས་རིས་ཀྱི་ལྷ་ཐམས་ཅད་ལ་སྨྲས་པ། གྲོགས་པོ་དག་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་བསགས་པ།
en: “Then, with a feeling of great joy in his heart, Great Brahmā, sovereign of this Sahā world and lord of the cosmos of a billion worlds, spoke to all the gods of the Heaven of Brahmā’s Assembly: ‘Friends, this great and true person is an accumulation of the vows and austerities he has undertaken over many hundreds of thousands of eons.

source: སྐྱེས་བུ་ཆེན་པོ་དམ་པ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་བཞུད་ཀྱིས།
en: He is now approaching the seat of awakening.

source: དེ་ལ་ཁྱེད་ཀྱིས་བཀོད་པ་ཆེན་པོ་རྣམས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཐམས་ཅད་བརྒྱན་པར་གྱིས་ཤིག །
en: Therefore, you should decorate the entire cosmos of a billion worlds with great, splendorous arrangements.’

source: དེ་ནས་ཚངས་པ་ཆེན་པོ་མི་མཇེད་ཀྱི་བདག་པོས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, at that moment, Great Brahmā, sovereign of this Sahā world, spoke the following verses:

source: སེམས་ཅན་རྣམ་དག་བརྟུལ་ཞུགས་ཆོས་ངེས་པ། །
en: “ ‘A purified being whose vow is resolved on the Dharma,

source: ལྷར་བཅས་འཇིག་རྟེན་དག་ལ་ཕན་བཞེད་པ། །
en: Who acts for the benefit of the world with its gods,

source: ལྷ་དང་མི་ཡིས་མཆོད་པ་ལྷ་ཡི་ལྷ། །
en: Supreme God of Gods, worshiped by gods and men,

source: ཐུབ་པ་ཆེན་པོ་བྱང་ཆུབ་སྙིང་པོར་གཤེགས། །
en: The Great Sage is walking to the seat of awakening.

source: སྡེ་དང་བཅས་པའི་བདུད་ནི་གདུལ་བ་དང་། །
en: “ ‘For the sake of conquering Māra and his army,

source: ཐམས་ཅད་མཁྱེན་གྱི་ཡེ་ཤེས་འཚང་རྒྱ་དང་། །
en: For the sake of awakening the knowledge that is wakefulness,

source: རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྣམས་ཡོངས་བཀང་དང་། །
en: For the sake of perfecting the qualities of complete awakening,

source: དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། །
en: For the sake of turning the wheel of the true Dharma,

source: མཁས་པ་སེང་གེའི་སྒྲ་ཆེན་བསྒྲག་པ་དང་། །
en: “ ‘He has the aim to roar the great lion’s roar,

source: སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱ་བ་དང་། །
en: And, indeed, the purpose of satisfying all embodied beings.

source: དམ་པའི་ཆོས་མིག་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། །
en: For the sake of purifying the eye of the supreme Dharma,

source: འདྲེན་པ་བྱང་ཆུབ་སྙིང་པོར་ཉེ་བར་གཤེགས། །
en: The Guide is going to the seat of awakening.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་ནི་ཚར་གཅད་དང་། །
en: “ ‘For the sake of defeating the proponents of other doctrines,

source: སྔོན་གྱི་དམ་བཅས་ཡོངས་སུ་བཀང་བ་དང་། །
en: For the sake of fulfilling the promises he made previously,

source: རྫོགས་སངས་རྒྱས་ཀྱི་མཛད་པ་བསྟན་པའི་ཕྱིར། །
en: For the sake of displaying the deeds of a perfect buddha, too,

source: ལེགས་པར་ཐམས་ཅད་ལྷན་ཅིག་འདུས་ནས་ནི། །
en: “ ‘Therefore, all of us, gathered together,

source: ས་ཡི་གཞི་ནི་ལེགས་པར་བརྒྱན་པར་བྱ། །
en: We will adorn the fertile ground properly.

source: སྟོང་གསུམ་བརྒྱན་པར་གྱུར་ལ་ལྟོས་ཤིག་ཀྱེ། །
en: Oh, let us see the billion worlds adorned!

source: འདོད་པའི་ཁམས་ཀྱང་བརྒྱན་པར་གྱུར་པ་ལྟོས། །འདོད་པའི་ཁམས་ནི་ཇི་ལྟར་བརྒྱན་པ་བཞིན། །
en: Let us see the desire realm adorned!’

source: དེ་ལྟར་གཟུགས་ཀྱི་ཁམས་ཀྱང་བརྒྱན་པར་བྱ། །
en: “ ‘We will adorn the form realm in precisely the same way!’ the brahmās said,

source: ཚངས་པ་རྣམས་ནི་སེམས་དང་ལེགས་སོ་ཞེས། །
en: And the Paternal Grandfather, gladdened at heart, said, ‘Good.’

source: རབ་ཏུ་དགའ་ནས་སྟོང་གསུམ་བརྒྱན་པར་གྱུར། །
en: Then they set about decorating the rest of this Sahā world

source: ཇི་ལྟར་འདོད་པའི་ཁམས་ན་བཀོད་སྣང་བ། །
en: So that it appeared just like the splendid array of the desire realm.

source: དེ་བས་ལྷག་པའི་མཆོད་པ་དེ་དག་བསྟན། །
en: “Yet, what they displayed far exceeded that worship

source: མེ་ཏོག་རྣམས་ཀྱིས་བཀང་ཞིང་སྤོས་ཀྱིས་བཀང་། །
en: With an abundance of flowers and clouds of incense.

source: རིན་ཆེན་རྣམས་ཀྱིས་མཆོད་ཅིང་སིལ་སྙན་བསྒྲགས། །
en: With heaps of jewels and symphonies of music, It was something that incited rapture and reverence.

source: ཚངས་པ་ལ་སོགས་འོག་མིན་ལྷ་ཡི་རྣམས། །
en: “With splendid arrays like the surfaces of their own abodes, The brahmās and all the deities up to the Supreme Heaven

source: རབ་ཏུ་དགའ་ནས་སྟོང་གསུམ་ཐམས་ཅད་ཀྱང་། །
en: Enraptured truly everyone in the Sahā world

source: དགའ་བར་འགྱུར་དང་ཕྱག་བྱའི་འོས་སུ་བྱས། །རང་རང་གནས་ཀྱི་གཞི་ཡང་བཀོད་པ་བྱས། །
en: And made them feel they should bow down before it.

source: ལྷ་རྣམས་ཀྱིས་ནི་གོང་ནས་གོང་དུ་ཡང་། །
en: “The assemblies of gods displayed adornments

source: ལྷག་པ་ལྷག་པའི་རྒྱན་རྣམས་རབ་ཏུ་བསྟན། །
en: That rose higher and even higher into the sky,

source: ལྷ་ཡི་བུ་མོ་བྱེ་བ་དྲུག་ཅུ་བརྒྱས། །
en: While down here six hundred billion apsarases

source: བྱང་ཆུབ་རྡོ་རྗེ་གདན་ནི་རྒྱན་པར་བྱེད། །
en: Decorated the vajra seat of awakening.

source: སྤོས་ཆུ་ཡིས་ནི་ཀུན་ཏུ་ཆག་ཆག་འདེབས། །
en: “They sprinkled scented water everywhere,

source: མེ་ཏོག་སྣ་ཚོགས་དག་ཀྱང་འཐོར་བར་བྱེད། །ས་གཞི་དག་ལ་རིན་ཆེན་རྣམས་ཀྱང་བཀྲམ། །
en: And upon the surface of the fertile ground That had been prepared they scattered Many-colored flowers and splendorous jewels.

source: བྱང་ཆུབ་སྙིང་པོར་རྒྱན་རྣམས་རབ་ཏུ་བསྟན། །
en: “The tree of awakening was displayed with adornments,

source: ཐམས་ཅད་ཚིག་གིས་བརྗོད་པར་མི་ནུས་པ། །
en: The totality of which cannot be expressed in words.

source: དེ་སྙེད་ཚད་ཀྱི་བཀོད་པ་འདིར་བྱས་གྱུར། །
en: The splendid array that they made there Was at a scale just like that.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་སྟོང་གི་དབང་པོ་ཚངས་པ་ཆེན་པོ་མི་མཇེད་ཀྱི་བདག་པོས་ཚངས་རིས་ཀྱི་ལྷ་ཐམས་ཅད་ལ་སྨྲས་པ། གྲོགས་པོ་དག་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོར་བརྟུལ་ཞུགས་དང་།
en: “Then, Śāntamati, as the Bodhisattva was settling down upon the seat of awakening, Great Brahmā, lord of a thousand and sovereign of this Sahā world, spoke to all the gods of the Heaven of Brahmā’s Assembly: ‘Friends, this great person and preeminent being has been walking the proper path and undertaking vows and austerities for many hundreds of thousands of millions and billions of eons.

source: དཀའ་ཐུབ་རྣམས་ཀྱི་སྤྱོད་པ་སྤྱད་པ་སེམས་ཅན་གྱི་མཆོག་སྐྱེས་བུ་ཆེན་པོ་འདི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་ཀྱིས།
en: He is sitting down now upon the seat of awakening.

source: དེ་ལ་ཁྱེད་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་བཀོད་པ་ཆེན་པོ་རྣམས་ཀྱིས་བརྒྱན་པར་གྱིས་ཤིག །
en: Therefore, you all should decorate this whole cosmos of a billion worlds with great, splendorous arrangements.’

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་ཚངས་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Great Brahmā, sovereign of this Sahā world, spoke these verses to the gods of the Heaven of Brahmā’s Assembly:

source: སེམས་ཅན་རྣམ་དག་བརྟུལ་ཞུགས་ཆོས་དེས་པ། །
en: “ ‘A purified being whose vow is resolved on the Dharma,

source: ཕན་བཞེད་འཇིག་རྟེན་དོན་མཛད་བདག་ཉིད་ཆེ། །དེ་ནི་བློ་ངན་སྡེར་བཅས་བདུད་འདུལ་དུ། །
en: A magnanimous one who wants to help and does what is useful,

source: ཤིང་གི་དབང་པོ་བྱང་ཆུབ་དྲུང་དུ་བཞུད། །
en: He has drawn near to the tree of awakening

source: ཐམས་ཅད་འདུས་ཏེ་ལྷན་ཅིག་འདོང་བར་བྱ། །
en: To defeat the misguided Māra and his family, too. “ ‘Indeed, all of us, gathered together, shall proceed

source: སྟོང་གསུམ་མི་མཇེད་འདི་ནི་བརྒྱན་པར་བྱ། །
en: To decorate this Sahā world in its entirety.

source: འདི་ནི་ལྷར་བཅས་འཇིག་རྟེན་ཆོས་ཀྱི་དབང་། །
en: For this world, including its gods, he is the Lord of Dharma.

source: ཡང་དག་མཆོད་ན་བསོད་ནམས་མཐའ་ཡས་འགྱུར། །
en: So if we honor him with worship, we will gain infinite merit.’

source: ཚངས་པ་དེ་དག་ཚིག་མཆོག་དེ་ཐོས་ནས། །
en: “When the multitudes of brahmā gods heard that high praise,

source: སྟོང་གསུམ་ཐམས་ཅད་མ་ལུས་རྒྱན་བྱེད་ཅིང་། །
en: They decorated this Sahā world in its entirety.

source: ལེགས་པར་ཕྱགས་ཏེ་མེ་ཏོག་རྒྱལ་མཚན་བརྒྱན། །
en: They cleaned it well, adorned it with flowers and banners,

source: འཇིག་རྟེན་ཁམས་ནི་རིན་ཆེན་རང་བཞིན་སྤྲུལ། །
en: And transformed this Sahā world into something made of jewels.

source: ཉི་མ་ཟླ་བའི་འོད་ཀྱི་བཀོད་པ་དང་། །བྱེ་བའི་གདུགས་རྣམས་ནམ་མཁར་དེ་དག་སྤྲུལ། །
en: “They magically created tens of millions of parasols in the sky That were just like a splendid array of sunlight and moonlight;

source: སཱ་ལའི་ཤིང་རྣམས་མེ་ཏོག་མཆོག་སྤྲས་པ། །
en: They magically created sāla trees variegated with the finest flowers,

source: དགའ་ཚལ་ལྟ་བུ་དེ་དག་རྣམས་ཀྱིས་སྤྲུལ། །
en: Which were comparable to the trees in divine pleasure groves.

source: ལམ་གང་ནས་ནི་དྲང་སྲོང་ཆེ་གཤེགས་པ། །
en: “As the Wise One walked down the path,

source: དེ་ནི་ཤིང་རྟ་བདུན་བསྟམས་ཚད་དུ་སྤྲུལ། །
en: They magically created a train of seven chariots

source: རིན་ཆེན་གཞི་ལ་གསེར་གྱི་པདྨ་བཀྲམ། །ཁ་ཁྱེར་རིམ་པ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར། །
en: And surrounded him with seven concentric railings Made with jewels and inlaid with golden lotuses.

source: བརྒྱ་བྱིན་གྱིས་དེར་བཀོད་པ་གང་བྱས་པ། །
en: “The whole splendid array that Śakra made there

source: དེ་དག་ལྷ་མི་རྣམས་ཀྱིས་སྔོན་མ་མཐོང་། །
en: Truly had never been seen before by gods or humans.

source: སུམ་ཅུ་གསུམ་དབང་རྣམ་རྒྱལ་ཁང་འདྲ་བར། །
en: Verily, the continents were made to shine

source: དེ་ལྟར་གླིང་བཞི་དག་ནི་མཛེས་པར་བརྒྱན། །
en: So that they were adorned like Śakra’s Vaijayanta Palace.

source: འཐབ་བྲལ་ལྷ་དང་དགའ་ལྡན་འཕྲུལ་བ་དང་། །
en: “Gods of the Yāma Heaven, the Heaven of the Contented,

source: གཞན་འཕྲུལ་བ་དང་འོག་མིན་ལྷ་ཡི་རྣམས། །
en: The Heavens of Delighting in Magical Creations and Transforming Others’ Delight,

source: སྟོབས་དང་ཤུགས་འཆང་ཐམས་ཅད་བརྩོན་པར་ནི། །
en: And the Supreme Heaven, bearing strength and excitement,

source: བྱང་ཆུབ་སྙིང་པོ་དམ་པ་རྒྱན་པར་བྱེད། །
en: Were all intent upon decorating the sublime seat of awakening.

source: བྱང་ཆུབ་སྙིང་པོར་གཤེགས་པའི་བར་དེར་ནི། །
en: “As the Bodhisattva came close to the seat,

source: འདོད་པའི་ཁམས་འདིར་དཀོན་མཆོག་གང་ཡོད་པ། །
en: The most splendorous arrays were all displayed At that very moment here in the desire realm

source: ལྷ་འམ་ཀླུ་འམ་མི་འམ་ཅི་རྣམས་ཀྱི། །དེ་དག་ཐམས་ཅད་སྐད་ཅིག་དེ་ལ་བསྟན། །
en: By the nāgas, deities, and kinnaras.

source: ཕྱོགས་བཞི་དག་ནས་ལྷ་མོ་བྱེ་བ་ལྷགས། །
en: “From the four directions came tens of millions of apsarases,

source: མེ་ཏོག་རྣམས་དང་སྤོས་དང་བྱུག་པ་ཡིས། །བྱང་ཆུབ་ཤིང་ནི་མངོན་དུ་རྒྱན་པར་བྱེད། །
en: Who decorated the tree of awakening With flowers, incense, and scented oils,

source: བྱང་ཆུབ་ཤིང་ནི་ལེགས་པར་བརྒྱན་བྱས་ཏེ། །
en: “The tree of awakening was so well decorated

source: སུམ་ཅུ་རྩ་གསུམ་ལྷ་ཡི་ཡོངས་འདུ་འདྲ། །
en: It shone like the Pārijāta tree in the Heaven of the Thirty-Three.

source: ལྷ་རྣམས་བྱེ་བ་དག་གིས་མཛེས་སྤྲུལ་པ། །
en: The splendorous arrays magically created by myriads of gods

source: བཀོད་པ་དེ་དག་ཚིག་གིས་བརྗོད་མི་ནུས། །
en: Shone so brightly they were impossible to describe.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་རྐང་པའི་མཐིལ་འཁོར་ལོ་རྩིབས་སྟོང་པ་གཉིས་ལས་འདི་འདྲ་བའི་འོད་ཕྱུང་སྟེ་འོད་དེས་སེམས་ཅན་དམྱལ་བ་དང་།
en: “Indeed, Śāntamati, as the Bodhisattva was stepping upon the seat of awakening, a light emanated from the thousand-spoked wheels on the soles of his feet.

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྣམས་རྒྱུན་བཅད་དོ། །
en: This light relieved the painful suffering of the beings in all the hell realms, the realm of animals, and the realm of Yama.

source: ཀླུའི་རྒྱལ་པོ་ནག་པོའི་གནས་ཀྱང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: The abode of the nāga king Kālika was also pervaded with a great radiance.

source: དེ་ནས་ཀླུའི་བདག་པོ་ནག་པོས་བྱང་ཆུབ་སེམས་དཔའི་འོད་མཐོང་ནས་ཚིམ་ཞིང་མགུལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས།
en: When the nāga king Kālika saw the Bodhisattva’s light, he felt joyful, enraptured, glad at heart, delighted, and filled with pleasure.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ་ཐམས་ཅད་དང་ལྡན་པའི་རང་གི་འཁོར་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: He then spoke these verses to all the women of his inner chambers as well as their attendants:

source: གསེར་གྱི་ཁ་དོག་འདྲ་བའི་འོད། །
en: “ ‘When this golden light

source: གནས་འདིར་ལྷང་ངེར་གྱུར་པས་ན། །
en: Bathed this abode of mine,

source: ཁོ་བོའི་ལུས་ནི་རབ་ཏུ་ཚིམ། །
en: I felt a thrill in my body

source: སེམས་ཀྱང་རབ་ཏུ་དགའ་བར་གྱུར། །
en: And delight in my mind.

source: ཁོ་བོས་སྔོན་གྱི་སངས་རྒྱས་ཀྱི། །ལྟས་བཟང་མཐོང་བ་ལྟར་ན་ནི། །
en: “ ‘I saw signs like these Of the previous buddhas.

source: གདོན་མི་ཟ་བར་དཔའ་ཆེན་པོ། །
en: Doubtless, a great hero, a buddha,

source: སངས་རྒྱས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར། །
en: Will be coming into the world.

source: ལེགས་པར་ཕྱེ་མ་ཕྲེང་བ་དང་། །
en: “ ‘It is good that we take powders,

source: སྤོས་དང་མེ་ཏོག་བྱུག་པ་དང་། །
en: Garlands, scented oils, perfumes,

source: གསེར་དང་ནོར་བུ་མུ་ཏིག་དང་། །
en: Gold, jewels, and pearls,

source: དུང་དང་རྒྱན་ཕྲེང་མཆོག་རྣམས་དང་། །
en: Conches and necklaces.

source: རོལ་མོ་སིལ་སྙན་རྣམས་ཐོགས་ལ། །
en: “ ‘Grasping cymbals and musical instruments,

source: གདུགས་དང་རྒྱལ་མཚན་ཐོགས་ནས་ནི། །བ་དན་དག་ཀྱང་བསྒྲེང་བྱས་ཏེ། །
en: And holding aloft parasols And banners of victory,

source: སྟོན་པ་ལ་ནི་མཆོད་པར་བྱ། །
en: We will worship the Teacher.

source: ཀླུ་ཡི་རྒྱལ་པོའི་གནས་འདི་ན། །
en: “ ‘Joyfully we will serve the Sage

source: བཟང་པོའི་རྒྱན་རྣམས་ཇི་སྙེད་པ། །
en: With those ornaments

source: དེ་དག་རབ་ཏུ་དགའ་བ་ཡིས། །
en: That are most splendorous

source: སངས་རྒྱས་ལ་ནི་རིམ་གྲོ་བྱ། །
en: In this abode of nāgas.’

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ནག་པོ་ཆུང་མའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐོགས་པ་དང་།
en: “At that point, the nāga king Kālika, along with the women from his inner chambers, his attendants and relations, and his sons and the members of his assembly, left his abode, all of them bearing flowers, incense, garlands, perfumes, powders, clothes, parasols, banners, and flags while playing cymbals, drums, and other musical instruments.

source: སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། རོལ་མོའི་སྒྲ་འབྱིན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རང་གི་གནས་ནས་བྱུང་སྟེ་སྤོས་ཆུས་གང་བའི་སྤྲིན་མངོན་པར་སྤྲུལ་ནས་སྤོས་ཆུའི་ཆར་པ་ནི་འབེབས། ཀླུའི་མུ་ཏིག་དང་། ཀླུའི་མེ་ཏོག་གི་ཆར་ནི་འབེབས་ཤིང་།
en: They created clouds full of fragrant water, produced rain showers of fragrant rain, and made it rain a shower of nāga pearls and nāga flowers.

source: ཀླུའི་མཐུ་ཆེན་པོ་དང་།
en: Thus, with the great marvelous presence of the nāgas and the great superhuman power of the nāgas, they approached the Bodhisattva.

source: ཀླུའི་རྫུ་འཕྲུལ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འཁོར་དང་བཅས་པས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱས་ཏེ་ཞབས་ལ་ཕྱག་འཚལ་ནས། རོལ་མོ་དང་། སིལ་སྙན་ལེན་པ་དང་།
en: Once they and their retinues had approached him, they worshiped the Bodhisattva, bowing down before him with their heads at his feet, and they circled around him while playing cymbals and musical instruments.

source: བཅས་པས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་མངོན་པར་བསྟོད་དོ། །
en: Then they stood to one side, praising him in verse.

source: སྐྱེས་བུ་མཆོག་གི་འོད་ནི་རབ་བཀྱེ་བས། །
en: “ ‘When the supreme person released that light

source: སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་སྣང་བར་གྱུར། །
en: This entire buddha domain was illuminated.

source: སྐད་ཅིག་དེ་ལ་ངན་སོང་གསུམ་ཡང་ཞི། །
en: For a moment, the three bad rebirths also ceased,

source: ནག་པོའི་གནས་ཀྱང་འོད་ཀྱིས་ཁྱབ་པར་གྱུར། །
en: And Kālika’s abode was pervaded with light.

source: ཀླུ་ཡི་རྒྱལ་པོ་དེ་ཡིས་འོད་མཐོང་ནས། །རབ་ཏུ་དགའ་སྟེ་དེ་ཚེ་ཚིག་སྨྲས་པ། །
en: “ ‘The king of nāgas appeared truly delighted, Seeing that light, and he spoke these words:

source: གསེར་གྱི་མདོག་གི་འོད་འདི་བྱུང་ལགས་ན། །དེ་རིང་སངས་རྒྱས་འབྱུང་དུ་གདོན་མི་ཟ། །
en: “Without a doubt, a buddha will come into being today, For this light is, indeed, his golden-colored radiance.

source: ཀླུ་མོ་ཁྲག་ཁྲིག་དག་གིས་མདུན་བདར་ཏེ། །
en: “ ‘ “Accompanied by multitudes of nāga girls

source: གདུགས་དང་མེ་ཏོག་གོས་མཆོག་ཐོགས་ནས་སུ། །
en: Carrying parasols, banners, and clothes,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ག་ལར་སོང་། །
en: Delighted, we come before the Bodhisattva

source: ཕྱག་བྱས་མཆོད་པ་བྱས་ནས་གུས་བཅས་འདུག །
en: To worship him with deep respect.

source: ས་ཀུན་རིན་ཆེན་མེ་ཏོག་རྣམས་ཀྱིས་གང་ཞིང་དེ་ཚེ་མཛེས་པར་བརྒྱན། །
en: “ ‘ “Adorned with an abundance of jewels and flowers, the whole earth is glittering;

source: ཤིང་མཆོག་ཀུན་དང་སྨན་དང་རྩྭ་རྣམས་དེ་དག་བྱང་ཆུབ་ཤིང་ལ་འདུད། །
en: All the groves of trees and medicinal shrubs are bending to the tree of awakening;

source: འདི་ན་ཡོད་པའི་ཆུ་ཀླུང་ཐམས་ཅད་མི་འབབ་མཁའ་ལ་རླུང་མི་ལྡང་། །
en: All the rivers here are standing still, and the wind has likewise ceased to blow,

source: དེ་རིང་བདུད་བཏུལ་ནས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འགྱུར། །
en: For today you conquer Māra and become a buddha celebrated in the three worlds.

source: སྲིད་པ་གསུམ་ན་བརྒྱ་བྱིན་ཚངས་པ་ཉི་མ་ཟླ་བའི་འོད་མི་སྣང་། །མཚུངས་མེད་ཁྱོད་ཀྱི་འོད་ཀྱིས་རེག་ནས་དེ་རིང་ངན་སོང་གསུམ་པོ་ཞི། །
en: “ ‘ “Today, you have dimmed the rays of light of the sun, moon, Brahmā, and Śakra With your light, Incomparable One, the touch of which has appeased the three bad rebirths.

source: བདག་གི་གནས་སུ་འོད་བྱུང་ནས་ནི་སངས་རྒྱས་འབྱུང་བ་སྟོན་པར་བགྱིད། །
en: May the coming of your light to our abode today, announcing the arising of a buddha,

source: དེ་རིང་རྒྱལ་བ་བྱོན་པར་འགྱུར་གྱིས་དགྱེས་མཛོད་རངས་ཤིང་ཚིམ་པ་སྐྱེད། །
en: Make us happy, too, and may your arising today, Worthy One, gladden our hearts.

source: བུམ་པ་གང་བ་འདི་དག་ནམ་མཁར་སོང་སྟེ་ཁྱོད་ལ་སྐོར་བ་དང་། །
en: “ ‘ “Just like these gods who come bearing full vessels and circle you,
